module Ryba
  class PhoneNumber
    Formats = [
      # локальные номера
      '?##-##-##',
      '?######',
      '?#-##-##',
      '?-##-##',
      
      # номера с кодом города
      '(###) ?##-##-##',
      '(###) ?## ## ##',
      '8 (###) ?##-##-##',
      '+7 (###) ?##-##-##',
      '(####) ?#-##-##',
      '(####) ?# ## ##',
      '8 (####) ?#-##-##',
      '+7 (####) ?#-##-##',
      '(#####) ?-##-##',
      '(#####) ? ## ##',
      '8 (#####) ?-##-##',
      '+7 (#####) ?-##-##',

      # мобильники
      '8-9##-###-####',
      '8-9##-###-##-##',
      '+7 9## ### ####',
      '+7 9## ### ####',
    ].freeze

    def self.phone_number
      fmt = Ryba.pick(Formats)

      # локальные номера не могут начинаться на 8 или 0
      Ryba.numerify(fmt.gsub('?') { Ryba.pick("12345679") })
    end
  end
end
